Revit 2027 API
UIDocument.Selection Property
Retrieve the currently selected Elements in Autodesk Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Selection Selection { get; }
Public ReadOnly Property Selection As Selection
	Get
public:
property Selection^ Selection {
	Selection^ get ();
}
member Selection : Selection with get
Property Value
Selection
Remarks
Returns an object that represents the active selection. The Selection property returns an object that represents the active selection when the command was started.
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace